Catalogs/PredefinedReportsVariants.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>PredefinedReportsVariants</Name>
			<Comment>Predefined report options of the configuration</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Report</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VariantKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Enabled</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GroupByReport</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VisibleByDefault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Definition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettingsHash</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FieldNames</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParametersAndFiltersNames</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Placement</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Subsystem</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Important</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SeeAlso</Name>
							<Comment>To find option click "See also"</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/MetadataObjectIDs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>MetadataObjectIDs</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CollectionOrder</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Name</Name>
					<Comment>For example, "TaskAddressingObjects"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Synonym</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullName</Name>
					<Comment>For example, "ChartOfCharacteristicTypes.TaskAddressingObjects"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullSynonym</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WithoutData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmptyRefValue</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MetadataObjectKey</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NewRef</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ReportsVariantsReUse/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Subsystem "Variants of reports" (server, perf. perf.).
// 
// It is executed on server, the return values are cached for the time of the session.
////////////////////////////////////////////////////////////////////////////////

#Region ServiceProceduresAndFunctions

// Generates the list of the configuration reports that are available for the current user.
//
// Returns:
//   Array of <see. Catalogs.ReportsVariants.Attributes.Report> -
//       Reports references are available for the current user.
//
// Description:
//   This array should be used in all queries
//   to the ReportVariants catalog table as the filter by the Report attribute.
//
Function AvailableReports() Export
	Result = New Array;
	
	For Each ReportMetadata IN Metadata.Reports Do
		If AccessRight("view", ReportMetadata)
			AND CommonUse.MetadataObjectAvailableByFunctionalOptions(ReportMetadata) Then
			Result.Add(CommonUse.MetadataObjectID(ReportMetadata));
		EndIf;
	EndDo;
	
	Return Result;
EndFunction

// Generates the list of configuration report variants that are not available for the current user by functional options.
//
// Returns:
//   Array of CatalogRef.PredefinedReportsVariants -
//       Report variants that are disabled by the functional options.
//
// Description:
//   This array should be used in all queries
//   to the ReportVariants catalog table as an excluding filter by the PredefinedVariant attribute.
//
Function DisabledApplicationOptions() Export
	// Get options that are unavailable by functional options.
	
	ConstantValue = Constants.ReportVariantParameters.Get();
	Structure = ConstantValue.Get();
	OptionsTable = Structure.TableFunctionalOptions;
	OptionsTable.Columns.Add("ReportIsAvailable", New TypeDescription("Boolean"));
	OptionsTable.Columns.Add("OptionValue", New TypeDescription("Number"));
	
	UserReporting = ReportsVariantsReUse.AvailableReports();
	For Each ReportRef IN UserReporting Do
		Found = OptionsTable.FindRows(New Structure("Report", ReportRef));
		For Each TableRow IN Found Do
			TableRow.ReportIsAvailable = True;
			Value = GetFunctionalOption(TableRow.FunctionalOptionName);
			If Value = True Then
				TableRow.OptionValue = 1;
			EndIf;
		EndDo;
	EndDo;
	
	OptionsTable.GroupBy("PredefinedVariant, ReportIsAvailable", "OptionValue");
	VariantTable = OptionsTable.Copy(New Structure("ReportIsAvailable, OptionValue", True, 0));
	VariantTable.GroupBy("PredefinedVariant");
	DisabledVariants = VariantTable.UnloadColumn("PredefinedVariant");
	
	// Add variants that were disabled by the developer.
	Query = New Query;
	Query.SetParameter("UserReporting", UserReporting);
	Query.SetParameter("ArrayOfDisabled", DisabledVariants);
	Query.Text =
	"SELECT ALLOWED
	|	PredefinedReportsVariants.Ref
	|FROM
	|	Catalog.PredefinedReportsVariants AS PredefinedReportsVariants
	|WHERE
	|	PredefinedReportsVariants.Enabled = FALSE
	|	AND PredefinedReportsVariants.Report IN(&UserReporting)
	|	AND Not PredefinedReportsVariants.Ref IN (&ArrayOfDisabled)
	|	AND PredefinedReportsVariants.DeletionMark = FALSE";
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		DisabledVariants.Add(Selection.Ref);
	EndDo;
	
	Return DisabledVariants;
EndFunction

// Generates the tree of subsystems that are available for the current user.
//
// Returns: 
//   Result - ValueTree -
//       * SectionRef      - CatalogRef.MetadataObjectIDs - Ref of section.
//       * Ref             - CatalogRef.MetadataObjectIDs - Ref of subsystem.
//       * Name            - String - Subsystem name.
//       * DescriptionFull - String - Full name of the subsystem.
//       * Presentation    - String - Presentation of the subsystem.
//       * Priority        - String - Subsystem priority.
//
Function CurrentUserSubsystems() Export
	Result = New ValueTree;
	Result.Columns.Add("Ref",              New TypeDescription("CatalogRef.MetadataObjectIDs"));
	Result.Columns.Add("Name",                 ReportsVariants.TypeDescriptionString(150));
	Result.Columns.Add("FullName",           ReportsVariants.TypeDescriptionString(510));
	Result.Columns.Add("Presentation",       ReportsVariants.TypeDescriptionString(150));
	Result.Columns.Add("SectionRef",        New TypeDescription("CatalogRef.MetadataObjectIDs"));
	Result.Columns.Add("Priority",           ReportsVariants.TypeDescriptionString(100));
	Result.Columns.Add("FullPresentation", ReportsVariants.TypeDescriptionString(300));
	
	RootRow = Result.Rows.Add();
	RootRow.Ref = Catalogs.MetadataObjectIDs.EmptyRef();
	RootRow.Presentation = NStr("en='All sections';ru='Все разделы'");
	
	ReportsVariants.AddCurrentUserSubsystems(RootRow, Undefined, Undefined);
	
	Return Result;
EndFunction

// Returns True if a user has a right to read the variants of reports.
Function ReadRight() Export
	Return AccessRight("Read", Metadata.Catalogs.ReportsVariants);
EndFunction

// Returns True if a user has a right to save the variants of reports.
Function AddRight() Export
	Return AccessRight("SaveUserData", Metadata) AND AccessRight("Insert", Metadata.Catalogs.ReportsVariants);
EndFunction

// The array of reports that store the settings of the ReportForm common form and redefine them in a module of the object.
//
// Returns:
//   Array of <see. Catalogs.ReportsVariants.Attributes.Report> -
//       The references of reports in the objects modules of which there is the DefineFormSettings procedure().
//
// See also:
//   ReportsVariantsOverridable.SetReportsVariants().
//
Function ReportsWithSettings() Export
	ConstantValue = Constants.ReportVariantParameters.Get();
	ReportsWithSettings = ConstantValue.Get().ReportsWithSettings;
	
	If CommonUse.SubsystemExists("StandardSubsystems.AdditionalReportsAndDataProcessors") Then
		ModuleAdditionalReportsAndDataProcessors = CommonUse.CommonModule("AdditionalReportsAndDataProcessors");
		ModuleAdditionalReportsAndDataProcessors.WhenDefineReportsWithSettings(ReportsWithSettings);
	EndIf;
	
	Return ReportsWithSettings;
EndFunction

#EndRegion
